##
## Brewfile contains all our brew dependencies
##


### App Directory
cask_args appdir: "/Applications"


### Taps (third-party repositories)
# Bundler for non-Ruby dependencies from Homebrew
tap "homebrew/bundle"

# Unofficial, Vendorless, and Walled Builds
tap "alehouse/homebrew-unofficial"

# Casks of fonts
tap "homebrew/cask-fonts"

# Remove a formula and its unused dependencies
tap "beeftornado/rmtree"

# Home for Swiftenv
tap "kylef/formulae"


### Brews

# Extendable version manager with support for Ruby, Node.js, Elixir, Erlang & more
brew "asdf"

# Decentralized dependency manager for Cocoa
brew "carthage"

# ⚠️ Stop saying "you forgot to …" in code review
brew "danger/tap/danger-swift"

# Distributed revision control system
brew "git"

# "GNU Pretty Good Privacy (PGP) package"
brew "gnupg"

# Mac App Store command line interface
brew "mas"

# Pinentry for GPG on Mac
brew "pinentry-mac"

# Swift Version Manager https://swiftenv.fuller.li/
brew "kylef/formulae/swiftenv"

# Tool to enforce Swift style and conventions
brew "swiftlint"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Programmable completion for Zsh
brew "zsh-completions"

### Apps

# Developer tools for Android development
cask "android-studio"

# small application which allows you to thoroughly uninstall unwanted apps
cask "appcleaner"

# Dropbox desktop client
cask "dropbox"

# Mozilla's web browser
cask "firefox"

# A desktop debugging platform for mobile developers.
cask "flipper"

# Client for the Google Drive storage service
cask "google-drive"

# Google's web browser
cask "google-chrome"

# Introspected tunnels to localhost
cask "ngrok"

# Delete with an Iron fist
cask "omnidisksweeper"

# Toolchain for API developers
cask "postman"

# Design toolkit built to help you create your best work
cask "figma"

# Capture your screen
cask "kap"

# Lightweight clipboard manager for macOS
cask 'maccy'

# Skype desktop client
cask "skype"

# Spotify desktop client
cask "spotify"

# # A fast, easy, and free BitTorrent client
cask "transmission"

# Visual Studio Code code editor
cask "visual-studio-code"

# Open-source media player
cask "vlc"

### Mac App Store

# # Adblock and privacy
# mas "AdGuard for Safari", id: 1440147259

# # Apple Developer
# mas "Apple Developer", id: 640199958

# # API Documentation Browser and Code Snippet Manager
# mas "Dash", id: 449589707

# # Digital audio workstations
# mas "GarageBand", id: 682658836

# # Block cookie and Tracking nags
# mas "Hush Nag Blocker", id: 1544743900

# # Video Editing
# mas "iMovie", id: 408981434

# # View JSON in a readable format
# mas "JSON Peep for Safari", id: 458969831

# # Presentation software
# mas "Keynote", id: 409183694

# # Workspace organiser
# mas "Magnet", id: 441258766

# # Spreadsheets
# mas "Numbers", id: 409203825

# # Word processor
# mas "Pages", id: 409201541

# # Clipboard Manager
# mas "PastePal - Clipboard Manager", id: 1503446680

# # Team communication
# mas "Slack", id: 803453959

# # Open any archive in seconds
# mas "The Unarchiver", id: 425424353

# # Developer tools
# mas "Xcode", id: 497799835


### Quick Look Plug-ins

# Preview archives
cask "betterzip"

# Preview JSON files
cask "quicklook-json"

# Preview Markdown files
cask "qlmarkdown"

# Preview source code files with syntax highlighting
cask "qlcolorcode"

# Display image size and resolution
cask "qlimagesize"

# A QuickLook plugin that lets you view plain text files without a file extension
cask "qlstephen"

# This package allows macOS Finder to display thumbnails, static QuickLook previews, cover art and metadata for most types of video files.
cask "qlvideo"


### Fonts

# Monospaced font with programming ligatures
cask "font-fira-code"

# The iconic font
cask "font-fontawesome"

# Material Design icons font by Google
cask "font-material-icons"

# New York font by Apple
cask "font-new-york"

# Open-sans font by Google
cask "font-open-sans"

# Roboto font by Google
cask "font-roboto"

# Monospaced Roboto font by Google
cask "font-roboto-mono"

# San Francisco Compact font by Apple
cask "font-sf-compact"

# San Francisco Mono font by Apple
cask "font-sf-mono"

# San Francisco Pro font by Apple
cask "font-sf-pro"

# Simple line icons font
cask "font-simple-line-icons"
