formulahendry.auto-close-tag
formulahendry.auto-rename-tag
wmaurer.change-case
naumovs.color-highlight
waderyan.gitblame
donjayamanne.githistory
eamodio.gitlens
mathiasfrohlich.Kotlin
ryu1kn.partial-diff
esbenp.prettier-vscode
mohsen1.prettify-json
sswg.swift-lang
loiane.ts-extension-pack
VisualStudioExptTeam.vscodeintellicode
msjsdiag.vscode-react-native
wayou.vscode-todo-highlight

